; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v12 ?v9)
             (pred_9 ?v2 ?v3)
             (pred_3 ?v12 ?v3)
             (pred_6 ?v8 ?v12 )
	     (pred_1 ?v12)
             (pred_7 ?v6)
             (pred_2 ?v2)
             (pred_10 ?v3)
             (pred_4 ?v12)
             (pred_12 ?v2)
             (pred_11 ?v12)
             (pred_5 ))



(:action op_3
:parameters (?v7 ?v10 ?v1 ?v13)
:precondition (and (pred_7 ?v7) (pred_7 ?v10) (pred_2 ?v1) (pred_10 ?v13)
          (pred_8 ?v7 ?v10) (pred_9 ?v1 ?v13)
                   (pred_3 ?v10 ?v13) (pred_1 ?v7) 
                   (pred_4 ?v10) (pred_12 ?v1))
:effect (and  (pred_11 ?v10) (not (pred_4 ?v10))))


(:action op_4
:parameters (?v7 ?v5)
:precondition (and (pred_7 ?v7) (pred_7 ?v5)
               (pred_1 ?v7) (pred_8 ?v7 ?v5) (pred_11 ?v5))
:effect (and (pred_1 ?v5) (not (pred_1 ?v7))))

(:action op_1
:parameters (?v7 ?v1)
:precondition (and (pred_7 ?v7) (pred_2 ?v1) 
                  (pred_1 ?v7) (pred_6 ?v1 ?v7) (pred_5 ))
:effect (and (pred_12 ?v1)
   (not (pred_6 ?v1 ?v7)) (not (pred_5 ))))


(:action op_5
:parameters (?v7 ?v4 ?v11)
:precondition (and (pred_7 ?v7) (pred_2 ?v4) (pred_2 ?v11)
                  (pred_1 ?v7) (pred_12 ?v11) (pred_6 ?v4 ?v7))
:effect (and (pred_12 ?v4) (pred_6 ?v11 ?v7)
        (not (pred_12 ?v11)) (not (pred_6 ?v4 ?v7))))

(:action op_2
:parameters (?v7 ?v1)
:precondition (and (pred_7 ?v7) (pred_2 ?v1) 
                  (pred_1 ?v7) (pred_12 ?v1))
:effect (and (pred_5 ) (pred_6 ?v1 ?v7) (not (pred_12 ?v1)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_02 obj_04 obj_15 obj_21 obj_06 obj_10 obj_18 obj_03 obj_13 obj_09 obj_11 obj_19 obj_17 obj_12 obj_20
    obj_05 obj_08
    obj_14 obj_01 obj_07
    )

    (:init
       (pred_5)

       (pred_7 obj_16)
       (pred_7 obj_02)
       (pred_7 obj_04)
       (pred_7 obj_15)
       (pred_7 obj_21)
       (pred_7 obj_06)
       (pred_7 obj_10)
       (pred_7 obj_18)
       (pred_7 obj_03)
       (pred_7 obj_13)
       (pred_7 obj_09)
       (pred_7 obj_11)
       (pred_7 obj_19)
       (pred_7 obj_17)
       (pred_7 obj_12)
       (pred_7 obj_20)
       (pred_10 obj_05)
       (pred_10 obj_08)
       (pred_2 obj_14)
       (pred_2 obj_01)
       (pred_2 obj_07)

       (pred_8 obj_16 obj_21)
       (pred_8 obj_16 obj_02)
       (pred_8 obj_02 obj_06)
       (pred_8 obj_02 obj_04)
       (pred_8 obj_02 obj_16)
       (pred_8 obj_04 obj_10)
       (pred_8 obj_04 obj_15)
       (pred_8 obj_04 obj_02)
       (pred_8 obj_15 obj_18)
       (pred_8 obj_15 obj_04)
       (pred_8 obj_21 obj_03)
       (pred_8 obj_21 obj_06)
       (pred_8 obj_21 obj_16)
       (pred_8 obj_06 obj_13)
       (pred_8 obj_06 obj_10)
       (pred_8 obj_06 obj_02)
       (pred_8 obj_06 obj_21)
       (pred_8 obj_10 obj_09)
       (pred_8 obj_10 obj_18)
       (pred_8 obj_10 obj_04)
       (pred_8 obj_10 obj_06)
       (pred_8 obj_18 obj_11)
       (pred_8 obj_18 obj_15)
       (pred_8 obj_18 obj_10)
       (pred_8 obj_03 obj_19)
       (pred_8 obj_03 obj_13)
       (pred_8 obj_03 obj_21)
       (pred_8 obj_13 obj_17)
       (pred_8 obj_13 obj_09)
       (pred_8 obj_13 obj_06)
       (pred_8 obj_13 obj_03)
       (pred_8 obj_09 obj_12)
       (pred_8 obj_09 obj_11)
       (pred_8 obj_09 obj_10)
       (pred_8 obj_09 obj_13)
       (pred_8 obj_11 obj_20)
       (pred_8 obj_11 obj_18)
       (pred_8 obj_11 obj_09)
       (pred_8 obj_19 obj_17)
       (pred_8 obj_19 obj_03)
       (pred_8 obj_17 obj_12)
       (pred_8 obj_17 obj_13)
       (pred_8 obj_17 obj_19)
       (pred_8 obj_12 obj_20)
       (pred_8 obj_12 obj_09)
       (pred_8 obj_12 obj_17)
       (pred_8 obj_20 obj_11)
       (pred_8 obj_20 obj_12)
       (pred_4 obj_03)
       (pred_4 obj_02)
       (pred_4 obj_11)
       (pred_3  obj_03 obj_05)
       (pred_3  obj_02 obj_08)
       (pred_3  obj_11 obj_05)
       (pred_11 obj_16)
       (pred_11 obj_04)
       (pred_11 obj_15)
       (pred_11 obj_21)
       (pred_11 obj_06)
       (pred_11 obj_10)
       (pred_11 obj_18)
       (pred_11 obj_13)
       (pred_11 obj_09)
       (pred_11 obj_19)
       (pred_11 obj_17)
       (pred_11 obj_12)
       (pred_11 obj_20)

       (pred_9  obj_14 obj_05)
       (pred_9  obj_01 obj_08)
       (pred_9  obj_07 obj_08)
       (pred_6 obj_14 obj_06)
       (pred_6 obj_01 obj_15)
       (pred_6 obj_07 obj_15)
       (pred_1 obj_10)
    )

    (:goal (and
       (pred_6 obj_14 obj_10)
       (pred_6 obj_01 obj_09)
       (pred_6 obj_07 obj_19)
    ))
(:constraints
  (always (not (pred_1 obj_04)))
)
)

; plan
1. (op_4 obj_10 obj_06)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_06)
   goals met: 0 of 3
2. (op_1 obj_06 obj_14)
   deleted: (pred_6 obj_14 obj_06) (pred_5)
   added: (pred_12 obj_14)
   goals met: 0 of 3
3. (op_4 obj_06 obj_10)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_10)
   goals met: 0 of 3
4. (op_2 obj_10 obj_14)
   deleted: (pred_12 obj_14)
   added: (pred_5) (pred_6 obj_14 obj_10)
   goals met: 1 of 3
5. (op_4 obj_10 obj_18)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_18)
   goals met: 1 of 3
6. (op_4 obj_18 obj_15)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_15)
   goals met: 1 of 3
7. (op_1 obj_15 obj_01)
   deleted: (pred_6 obj_01 obj_15) (pred_5)
   added: (pred_12 obj_01)
   goals met: 1 of 3
8. (op_4 obj_15 obj_18)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_18)
   goals met: 1 of 3
9. (op_4 obj_18 obj_10)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_10)
   goals met: 1 of 3
10. (op_4 obj_10 obj_09)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_09)
   goals met: 1 of 3
11. (op_2 obj_09 obj_01)
   deleted: (pred_12 obj_01)
   added: (pred_5) (pred_6 obj_01 obj_09)
   goals met: 2 of 3
12. (op_4 obj_09 obj_10)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_10)
   goals met: 2 of 3
13. (op_4 obj_10 obj_18)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_18)
   goals met: 2 of 3
14. (op_4 obj_18 obj_15)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_15)
   goals met: 2 of 3
15. (op_1 obj_15 obj_07)
   deleted: (pred_6 obj_07 obj_15) (pred_5)
   added: (pred_12 obj_07)
   goals met: 2 of 3
16. (op_4 obj_15 obj_18)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_18)
   goals met: 2 of 3
17. (op_4 obj_18 obj_10)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_10)
   goals met: 2 of 3
18. (op_4 obj_10 obj_06)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_06)
   goals met: 2 of 3
19. (op_4 obj_06 obj_13)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_13)
   goals met: 2 of 3
20. (op_4 obj_13 obj_17)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_17)
   goals met: 2 of 3
21. (op_4 obj_17 obj_19)
   deleted: (pred_1 obj_17)
   added: (pred_1 obj_19)
   goals met: 2 of 3
22. (op_2 obj_19 obj_07)
   deleted: (pred_12 obj_07)
   added: (pred_5) (pred_6 obj_07 obj_19)
   goals met: 3 of 3
